{
  "life_path": {
    "1": "Independent, pioneering, and ambitious. Life is about leadership and forging your own path.",
    "2": "Diplomatic, cooperative, and sensitive. Life is about building harmony with others.",
    "3": "Creative, expressive, and optimistic. Life is about communication and joy.",
    "4": "Practical, disciplined, and reliable. Life is about building solid foundations.",
    "5": "Adventurous, adaptable, and freedom-loving. Life is about embracing change.",
    "6": "Responsible, nurturing, and compassionate. Life is about service and family.",
    "7": "Introspective, analytical, and spiritual. Life is about seeking truth and wisdom.",
    "8": "Ambitious, authoritative, and material-focused. Life is about mastery of power.",
    "9": "Humanitarian, idealistic, and generous. Life is about serving the greater good.",
    "11": "Visionary, intuitive, and inspiring. Life is about spiritual illumination.",
    "22": "Practical dreamer, master builder. Life is about turning vision into lasting impact."
  },

  "expression": {
    "1": "You are a natural leader, destined to be independent and self-reliant.",
    "2": "You thrive in partnerships, diplomacy, and teamwork.",
    "3": "You express yourself through creativity, humor, and joy.",
    "4": "You are dependable, hardworking, and thrive on order.",
    "5": "You are versatile, adventurous, and thrive on freedom.",
    "6": "You are nurturing, responsible, and bring harmony to others.",
    "7": "You are reflective, thoughtful, and drawn to spiritual pursuits.",
    "8": "You are ambitious, authoritative, and effective in business.",
    "9": "You are compassionate, generous, and motivated to help humanity.",
    "11": "You are spiritually inspired, intuitive, and a natural teacher.",
    "22": "You are capable of achieving great things with vision and discipline."
  },

  "soul_urge": {
    "1": "At heart, you long for independence and self-expression.",
    "2": "You deeply desire harmony, love, and companionship.",
    "3": "Your soul craves joy, creativity, and self-expression.",
    "4": "You seek order, stability, and security at a soul level.",
    "5": "You yearn for freedom, adventure, and new experiences.",
    "6": "You are driven by a need to nurture, serve, and love.",
    "7": "Your inner drive is to seek wisdom and spiritual truth.",
    "8": "You desire power, recognition, and material success.",
    "9": "You long to serve humanity and live with compassion.",
    "11": "You are motivated by inspiration, intuition, and higher purpose.",
    "22": "You are driven to build lasting achievements that help others."
  },

  "personality": {
    "1": "You come across as confident, direct, and independent.",
    "2": "You appear gentle, cooperative, and diplomatic.",
    "3": "You are seen as creative, fun, and expressive.",
    "4": "You seem disciplined, reliable, and grounded.",
    "5": "You come across as adaptable, exciting, and adventurous.",
    "6": "You appear caring, responsible, and trustworthy.",
    "7": "You are seen as thoughtful, mysterious, and wise.",
    "8": "You come across as ambitious, successful, and authoritative.",
    "9": "You appear compassionate, idealistic, and humanitarian.",
    "11": "You radiate intuition, charisma, and spiritual awareness.",
    "22": "You come across as visionary, practical, and influential."
  },

  "birthday": {
    "1": "Independent and pioneering spirit.",
    "2": "Gentle, sensitive, and cooperative.",
    "3": "Joyful, expressive, and creative.",
    "4": "Practical, disciplined, and structured.",
    "5": "Adventurous, versatile, and curious.",
    "6": "Nurturing, loving, and responsible.",
    "7": "Introspective, wise, and analytical.",
    "8": "Ambitious, powerful, and achievement-focused.",
    "9": "Compassionate, idealistic, and generous.",
    "11": "Highly intuitive and inspirational.",
    "22": "Practical visionary and master builder."
  },

  "maturity": {
    "1": "Maturity brings independence and self-reliance, achieving personal goals through leadership.",
    "2": "Maturity focuses on diplomacy, cooperation, and forming harmonious relationships.",
    "3": "Maturity encourages creative self-expression and joyful communication.",
    "4": "Maturity emphasizes discipline, building stability, and practical accomplishment.",
    "5": "Maturity brings adaptability, embracing change and seeking freedom.",
    "6": "Maturity focuses on responsibility, nurturing, and service to others.",
    "7": "Maturity guides toward wisdom, introspection, and spiritual insight.",
    "8": "Maturity brings practical mastery, ambition, and material achievement.",
    "9": "Maturity emphasizes compassion, humanitarian work, and vision for others.",
    "11": "Maturity encourages spiritual inspiration and teaching, harnessing intuition.",
    "22": "Maturity drives mastery of large-scale achievements, building lasting structures."
  },

  "balance": {
    "1": "Balance suggests using independence wisely, channeling energy into constructive leadership.",
    "2": "Balance emphasizes diplomacy and gentle influence in relationships.",
    "3": "Balance encourages expressing creativity in a measured and effective way.",
    "4": "Balance focuses on stability and reliability in all actions.",
    "5": "Balance guides adventurous energy toward productive change.",
    "6": "Balance encourages nurturing others while maintaining personal responsibility.",
    "7": "Balance emphasizes reflection, thoughtfulness, and careful planning.",
    "8": "Balance channels ambition toward structured and ethical achievement.",
    "9": "Balance directs compassion and vision into meaningful action.",
    "11": "Balance promotes spiritual insight tempered with practical application.",
    "22": "Balance helps transform visionary plans into tangible results."
  },

  "personal_year": {
    "1": "A year of new beginnings and fresh starts. Time to take initiative and plant seeds.",
    "2": "A year of patience, cooperation, and building relationships.",
    "3": "A year of self-expression, creativity, and joy.",
    "4": "A year of hard work, discipline, and laying solid foundations.",
    "5": "A year of change, adventure, and unexpected opportunities.",
    "6": "A year of responsibility, family, and service to others.",
    "7": "A year of introspection, study, and spiritual growth.",
    "8": "A year of ambition, material success, and achievement.",
    "9": "A year of completion, release, and preparing for new cycles.",
    "11": "A spiritually significant year, filled with inspiration and heightened intuition.",
    "22": "A master year for building something of lasting significance."
  },

  "personal_month": {
    "1": "A month to take initiative and begin something new.",
    "2": "A month for diplomacy, patience, and relationships.",
    "3": "A creative and expressive month, ideal for communication.",
    "4": "A month of steady work, discipline, and order.",
    "5": "A month of change, travel, and adventure.",
    "6": "A nurturing month focused on family and responsibility.",
    "7": "A reflective month of learning and contemplation.",
    "8": "A month to pursue goals, business, and achievement.",
    "9": "A month of endings, compassion, and generosity.",
    "11": "A month of spiritual inspiration and heightened intuition.",
    "22": "A month to make practical progress on big visions."
  },

  "personal_day": {
    "1": "Take initiative today. Good for starting something new.",
    "2": "Focus on relationships and diplomacy today.",
    "3": "A creative, joyful day for self-expression.",
    "4": "A disciplined, practical day to get things done.",
    "5": "Expect change and variety today. Stay adaptable.",
    "6": "A nurturing day to help family or loved ones.",
    "7": "A reflective day for study or spiritual practice.",
    "8": "A strong day for business, goals, and achievement.",
    "9": "A compassionate day to give back and let go.",
    "11": "An inspired day of intuition and spiritual awareness.",
    "22": "A day for practical steps toward long-term goals."
  }
}
